package main

import (
	"fmt"
	"regexp"
	"strings"
)

var (
	errInvalidMinMatches = fmt.Errorf("Invalid minMatches value")
	errCompilingError    = fmt.Errorf("Error compiling regular expression")
	errMatchingError     = fmt.Errorf("Error matching regular expression")

	sportEventRegExps = []string{
		`(?i)\b(?:манеж|стадион|метро|парк|поле)\b.*?(?:«[^»]+»|".+?"|[А-ЯЁа-яё]+)`,                                                       // place
		`\b(?:\d{1,2}\s*(?:января|февраля|марта|апреля|мая|июня|июля|августа|сентября|октября|ноября|декабря)|\d{1,2}.\d{1,2}.\d{2,4})\b`, // date
		`\b\d{1,2}:\d{2}(?:-\d{1,2}:\d{2})?\b`,                                           // time
		`\b(?:\d+\s*команд[ыа]?\s*\d+(×|\*|на|x|х)\d+|\d+(×|\*|на|x|х)\d+)\b`,            // game format
		`\b\d+(?:.\d+)?\s*(?:час[аов]|минут[ыа])\b`,                                      // duration
		`\b(взнос|цена)\s*\d+\s*(?:р.?|рубл(?:ей|я)?)\b|\b\d+\s*(?:р.?|рубл(?:ей|я)?)\b`, // price FIXME: this does not work as planned
		`\b(?:требуется|нужно|не хватает)\s*\d+\s*(?:человек|игрок[ов]|мест[ао])\b`,      // level
		`\b(?:видео(?:съёмка)?|вода для игроков|душевые|раздевалки)\b`,                   // facilities
		`\b(?:играем|поиграть|матч|тренировка)\b`,                                        // type
		`\bhttps?:\/\/[^\s]+`, // link

		"\b(турнир|соревнование|матч|встреча)\b",
		"\b(игра|поединок|матч)\b.*\b(по|против|с)\b",
		"\b(игра|поединок|матч)\b.*\b(вид спорта|видом спорта|тип спорта|типом спорта)\b",
		"\b(проходит|состоится|начнется|закончится)\b.*\b(в|на)\b.*\b(место|локация|адрес)\b",
		"\b(дата|время|когда)\b.*\b(проходит|состоится|начнется|закончится)\b",
		"\b(требуется|нужен|желателен)\b.*\b(уровень|уровень игрока|уровень игроков)\b",
		"\b(цена|стоимость|взнос|плата)\b",
		"\b(платная|бесплатная|стоит)\b",
		"\b(команда|командир|игрок)\b.*\b(требуется|нужен|желателен)\b",
		"\b(присоединиться|участвовать|участвуйте)\b",
		"\b(тур|матч|игра)\b.*\b(платно|бесплатно)\b",
		"\b(событие|мероприятие)\b.*\b(спортивное|вид спорта|тип спорта)\b",
	}
)

// detect checks if a string satisfies a specified number of regular expressions.
func detect(text string, regexps []string, minMatches int) (bool, error) {
	lowerText := strings.ToLower(text)
	if minMatches < 0 {
		return false, fmt.Errorf("%w: must be >= 0", errInvalidMinMatches)
	}
	if minMatches == 0 {
		return true, nil
	}

	matched := 0

	for _, regex := range regexps {
		re, err := regexp.Compile(regex)
		if err != nil {
			return false, fmt.Errorf("%w %q: %w", errCompilingError, regex, err)
		}
		if re.MatchString(lowerText) {
			matched++
		}
		if matched >= minMatches {
			return true, nil
		}
	}

	if matched < minMatches {
		return false, fmt.Errorf(
			"%w: the string does not satisfy the specified minimum number of regular expressions (%d of %d)",
			errMatchingError,
			matched,
			minMatches,
		)
	}

	return true, nil
}

// PASS

// 📍Манеж "СпортВсегда"
// Время 21:30-23:00
// Когда: 14.10.2024
// 📍м. Коньково
// м. Университет Дружбы Народов
// 🔹3 команды 6×6
// 🔹Видео, вода для игроков
// 🔹Взнос 1100р.`

// 	🔻Есть 4 места на сегодня🔻
// 📍Стадион "Ясенево"
// 🔹М. Ясенево 21:30
// 🔹2 команды 8×8
// 🔹1,5 часа игры нон-стоп
// 🔹Видеосъёмка всей игры + нарезка лучших моментов, вода для игроков
// 🔹Взнос 850
// ❗ Есть Абонементы%
// Кто готов ставим ➕
// Полное расписание игр🔻
// https://footballvmoskve.ru/`

// Парк «Сокольники»
// Митьковский проезд, д. 1
// Открытое поле в парке «Сокольники»
// Размер поля: 50 x 80
// Душевые, раздевалки
// Играем 7х7 и 10х10
// 16 Октября 21:00-22:30
// 750₽
// 1/2 большого поля, 3 команды (7х7)`

////////////////////////

// FAIL

// Требуется 5 человек для игры в футбол. Игра проходит в Москве. Дата и время не указаны. Цена - 1000 рублей. Присоединяйтесь!

// Метро Чертановская, Чертановская ул., 7, корп. 3
// Формат 9*9
// 15 октября
// 2 команды, время игры 90 минут
// Администратор на матче
// Мячи, манишки, заморозка и вода для игроков
// Видео съемка красивых моментов
// Раздевалки и душевые комнаты
// Удобное время начала тренировок
// Цена 1200 рублей

// Добрый день! Есть желающие 16.10 поиграть на манеже Волгоградский проспект 32/43,
// у нас забронирован манеж на полтора часа с 19:00 до 20:30, не хватает народу 3-5 человек цена 750 рублей.
