package app

import "testing"

func TestDetect(t *testing.T) {
	testCases := []struct {
		name string
		text string
	}{
		// TODO: rename tests
		{
			"test 1",
			`📍Манеж "СпортВсегда"
Время 21:30-23:00
Когда: 14.10.2024
📍м. Коньково
м. Университет Дружбы Народов
🔹3 команды 6×6
🔹Видео, вода для игроков
🔹Взнос 1100р.`,
		},
		{
			"test 2",
			`🔻Есть 4 места на сегодня🔻
📍Стадион "Ясенево"
🔹М. Ясенево 21:30
🔹2 команды 8×8
🔹1,5 часа игры нон-стоп
🔹Видеосъёмка всей игры + нарезка лучших моментов, вода для игроков
🔹Взнос 850
❗ Есть Абонементы%
Кто готов ставим ➕
Полное расписание игр🔻
https://footballvmoskve.ru/`,
		},
		{
			"test 3",
			`Парк «Сокольники»
Митьковский проезд, д. 1
Открытое поле в парке «Сокольники»
Размер поля: 50 x 80
Душевые, раздевалки
Играем 7х7 и 10х10
16 Октября 21:00-22:30
750₽
1/2 большого поля, 3 команды (7х7)`,
		},
		{
			"test 4",
			`Требуется 5 человек для игры в футбол. Игра проходит в Москве. Дата и время не указаны. Цена - 1000 рублей. Присоединяйтесь!`,
		},
		{
			"test 5",
			`Метро Чертановская, Чертановская ул., 7, корп. 3
Формат 9*9
15 октября
2 команды, время игры 90 минут
Администратор на матче
Мячи, манишки, заморозка и вода для игроков
Видео съемка красивых моментов
Раздевалки и душевые комнаты
Удобное время начала тренировок
Цена 1200 рублей`,
		},
		{
			"test 6",
			`Добрый день! Есть желающие 16.10 поиграть на манеже Волгоградский проспект 32/43,
у нас забронирован манеж на полтора часа с 19:00 до 20:30, не хватает народу 3-5 человек цена 750 рублей.`,
		},
	}

	for _, tc := range testCases {
		t.Run(tc.name, func(t *testing.T) {
			actual, err := Detect(tc.text, SportEventRegExps, 3)
			if !actual {
				t.Errorf("Did not return true, err: %q", err)
			}
		})
	}
}
